In [14]:
# Importing libraries
import pandas as pd
import numpy as np
import os

In [15]:
# turning path folder into string
path =r'/Users/lavinia/Documents/04-2020 Instacart Basket Analysis'

In [21]:
# import products.csv
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'),index_col = False)

In [20]:
# import orders_wrangled.csv
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

## Data Consistency Checks

In [24]:
# perform descriptive statistics for the numeric value in the orders dataframe
df_ords.describe()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [19]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

## Mixed-Type Data

In [25]:
# create a dataframe
df_test = pd.DataFrame()

In [26]:
# create a new column named mix, filling with numeric, string, and boolean values
df_test['mix'] = ['a', 'b', 1, True]

In [27]:
# to execute the head part of the data
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [29]:
# function for checking whether a dataframe contains any mixed-type columns
for col in df_test.columns.tolist(): # for loop to looping in each column in the dataframe , executing the same block of code
    weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis =1) # test to check whether the column has inconsistent data types (True, '1') or False, '0'
    if len(df_test[weird]) > 0: # "if" statement checks if the condition is met to execute print(col)
        print(col)

mix

In [30]:
# to fix the mixed-type issue and convert a column's data type from numeric to string
df_test['mix'] = df_test['mix'].astype('str') # can change str to 'int64' if we wanted numeric datatype

## Missing Values

In [ ]:
# Pandas recognizes the "NA" as a missing value, but not other types such as n/a, --, na
# we need to put them in the list in order for Panda to detect these formats.

# making a list of missing value type
# missing_values =["n/a", "na", "--"]

# when import the data, Pandas will recognize them right away
# df = pd.read_csv("file.csv", na_values = missing_values)

In [ ]:
# Finding missing value in the "string" column, the missing value is in the integer type, which will not be detected by panda straight away
# Detecting numbers
# for row in df['COLUMNA']:
#  try
#    int(row)
#    df.loc[cnt, 'COLUMNA'] = np.nan
#  except ValueError:
#    pass
#   cnt+=1

In [49]:
# Finding missing values/observations (There are 16 missing values in product_name column)
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [51]:
# Total number of missing values
df_prods.isnull().sum().sum()

16

In [32]:
# Create a subset of dataframe to view these 16 values
df_nan = df_prods[df_prods['product_name'].isnull()==True]

In [33]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [34]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [ ]:
# Imputation:

# Using Mean
# df['columns with missings'].fillna(mean value, inplace = True), Note: inplace = True is a parameter to modify data structure in place rather than creating a new copy of the data structure

# Using Median
# Median = df['column with missings'].median()
# df['columns with missings'].fillna(median value, inplace = True)

# liner interpolation = connecting two points with line

# Location imputation
# df.loc[2,'columns with missing'] = mean value

In [37]:
df_prods.shape

# number of row = 49,693 compared to 16 missing values

(49693, 5)

In [38]:
# Create a subset of dataframe for non missing values in the product_name column
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [40]:
df_prods_clean.shape

(49677, 5)

In [ ]:
# Dropping missing values:
# dropna() function will drop any row that contains at least one missing values

# Dropping all missing values
# df_prods.dropna(inplace = True)

# Dropping only the NaNs from a particular column
# df_prods.dropna(subset =['product_name'], inplace = True)

## Duplicates

In [41]:
# Finding duplicates in the dataframe
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [42]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [43]:
# Dropping the duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [44]:
df_prods_clean_no_dups.shape

(49672, 5)

In [47]:
# export the df_prods_clean_no_dups to prepared file
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index = False)